// src/data/herbData.js
export const herbData = [
  {
    id: 201,
    name: "當歸",
    category: "中藥", // 這裡設為「中藥」
    tag: "補血",
    description: "《景岳全書．本草正》：「當歸，其味甘而重，故專能補血；其氣輕而辛，故又能行血。補中有動，行中有補，誠血中之氣藥，亦血中之聖藥也。」",
    family: '繖形科',      // 科屬
    nature: '甘、辛，溫',// 性味
    meridian: '歸肝、心、脾經',  // 歸經
    source: '本品為繖形科多年生草本植物當歸 (Angelica sinensis (Oliv.) Diels) 的根。主產甘肅東南部岷縣（秦州），產量多，質量好；其次則為陝西、四川、雲南等地。秋未採挖，除去鬚根及泥沙，待水分稍蒸發後，捆成小把，上棚，用煙火慢慢熏乾。切薄片，或身、尾分別切片。生用或酒炒用。',           // 品種來源
    effect: '補血，活血，調經，止痛，潤腸。',           // 功效
  indications: '1.用於心肝血虛，面色萎黃，眩暈心悸等。當歸甘溫質潤，為補血要藥。常配熟地、白芍等同用，如四物湯。若氣血兩虛者，常與黃耆、人參等同用，如當歸補血湯、人參養榮湯等。\n2.用於血虛或血虛而兼有瘀滯的月經不調，痛經，經閉等症。當歸既能補血、活血，又能調經，為婦科要藥。如上述諸證，因於氣滯血瘀者，常配香附、桃仁、紅花；因於寒凝者，常配肉桂、艾葉，因偏血熱者，則常配赤芍、丹皮等。\n3.用於血虛，血滯而兼有寒凝，以及跌打損傷，風濕痺阻的疼痛證。當歸補血活血，又兼能散寒止痛，故可隨證配伍應用。如治血滯兼寒的頭痛，常配川芎、白芷等；氣血瘀滯的胸痛、脅痛，常配鬱金、香附等；治虛寒腹痛，常配桂枝、白芍等；治血痢腹痛，常配黃芩、黃連、木香等；治癥瘕積聚，常配三稜、莪朮等；治跌打損傷，常配乳香、沒藥等；治風濕痺痛、肢體麻木，常配羌活、桂枝、秦艽等。現代用於冠心病心絞痛、血栓閉塞性脈管炎等，亦取得一定療效。\n4.用於癰疽瘡瘍。當歸既能活血消腫止痛，又能補血生肌，故亦為外科所常用。用於瘡瘍初期，常配銀花、連翹、炮山甲等，以消腫止痛；用於痛疽潰後，氣血虧虛，常配人參、黃耆、熟地黃等，以補血生肌。\n5.用於血虛腸燥便秘。能養血潤腸通便。常配火麻仁、肉蓯蓉等同用。\n6.此外，還能治久咳氣喘。加《魯般經後錄》，觀音救苦散，以之配人參、粟殼、甘草等，謂「治嗽如神」。近代亦有單用5%當歸注射液注入膻中、肺俞等穴位，治療慢性支氣管炎者。',      // 主治
  dosage: '煎服，5～15g。一般生用，為加強活血則酒炒用。又通常補血用當歸身，活血用當歸尾，和血（補血活血）用全當歸。',           // 用法用量
  pharmacology: '當歸含有揮發油，油中主要成分為藁本內酯、正丁烯夫內酯、當歸酮、香荊芥酚等。另含水溶性成分阿魏酸、丁二酸、菸酸、尿嘧啶、腺嘌呤、豆甾醇-D-葡萄糖甙、香莢蘭酸、鉤吻螢光素等。此外，尚含當歸多糖、多種氨基酸、維生素A、B12、E、及多種為人體必需的多種元素等。\n1.當歸揮發油和阿魏酸能抑制子宮平滑肌收縮，而其水溶性或醇溶性非揮發性物質則能使子宮平滑肌興奮。當歸對子宮的作用取決於子宮的機能狀態而呈雙相調節作用。\n2.正丁烯夫內酯能對抗組胺-乙酸膽鹼噴霧所致豚鼠實驗性哮喘。\n3.當歸有抗血小板凝集和抗血栓作用，並能促進血紅蛋白及紅細胞的生成；有抗心肌缺血和擴張血管作用，並證明阿魏酸能改善外周循環。\n4.當歸對實驗性高血脂症有降低血脂作用。對非特異性和特異性免疫功能都有增強作用。\n5.當歸對小鼠四氯化碳引起的肝損傷有保護作用，並能促進肝細胞再生和恢復肝臟某些功能的作用。\n6.此外，還有鎮靜、鎮痛、抗炎、抗缺氧、抗輻射損傷及抑制某些腫瘤株生長和體外菌作用等。',     // 現代藥理
  literature: '1.《本經》：「主咳逆上氣…婦人漏下，絕子，諸惡瘡瘍、金瘡。」\n2.《景岳全書．本草正》：「當歸，其味甘而重，故專能補血；其氣輕而辛，故又能行血。補中有動，行中有補，誠血中之氣藥，亦血中之聖藥也。」',       // 文獻別錄 (新增)
  contraindication: ''  // 注意禁忌 (新增)
  }
];