export const oilData = [
  {
    id: "oil-1",
    category: "精油",
    name: "阿米香樹",
    englishName: "Amyris",
    constitutionTag: "未知",
    chemicalTag: "未知",
    description: "未知",
    oilTable: {
      typePart: "樹 / 木材",
      method: "蒸餾法",
      latin: "阿米香樹屬 Amyris balsamifera",
      family: "芸香科 Rutaceae",
      nature: "未知",
      meridian: "未知",
      constitution: "未知",
      // 💡 記得在資料庫這裡補上 indications 欄位
      indications: "失眠多夢、心神不寧、燙傷修復、緩解偏頭痛、平撫焦慮氣息。",
      noteAnalogy: "低音",
      planet: "未知",
      origin: "未知"
    },
    oilDetails: {
      scent: "木頭燃燒過後的乾燥香氣。",
      appearance: "阿米香樹野生於海地的山坡地。常見於小樹叢中，它是一種開有可愛白花的常綠樹，但它饒富價值的樹脂乃是從樹皮流出的。雖然也被稱為「西印度檀香」，但它並非檀香科的一員，不同地區所出產的阿米香樹的精油，品質屬性也各有不同，好壞主要取決於樹齡和含水量，如果木材被切得太細小，所能萃取的精油量也會減少。",
      historyMyth: "阿米香樹的木材內蘊含豐富的油份，木材燃燒時宛如蠟燭一般，因此它得了個別名叫蠟燭樹，而它常被劈來做柴火也就不足為奇了。在海地夜晚的海邊，漁人常以阿米香樹的枝條做成火把，來吸引螃蟹；同樣的，住在山裏的村民，在夜間將農作物或牲口運到城裏時，也是點燃阿米香樹的枝條來照路的。因為它堅固耐用，所以阿米香樹的木材也是築籬架的好材料。\n二次大戰前，大量的阿米香樹小塊木材，從委內瑞拉、海地和牙買加被運至德國以供蒸餾，蒸出的精油屬性據說頗似純正的印度檀香，而檀香精油被阿米香樹混摻的情形則時有所聞。阿米香樹精油的主要用途是做香水的定香劑和肥皂，也是化妝品的成份之一。",
      chemistry: "倍半萜——杜松烯，石竹烯，Cadinole",
      attribute: "抗菌、消炎、抗痙攣、催情、化痰、降低血壓、鎮靜",
      caution: "氣味縈繞不絕，有些人未必會習慣，其他的負面作用則還未被發現。",
      mindEffect: "舒緩神經緊張。",
      bodyEffect: "有關這種精油的知識甚少，除了它多彩多姿的應用歷史以外。它的各種療效，其實主要是以其倍半萜烴的成份，和近似檀香的特質推論而來的。\n由此，我們大概可以判定這種精油較為鎮靜、安撫，而這也和它的低音特質互相呼應，別忘了阿米香樹是被用做香水中的定香劑。它抗痙孿的本質源自鎮定安撫的特性，而且就像檀香一般，阿米香樹有益於咳嗽和胸腔方面的毛病，也許能降低血壓。\n大部份的精油都有抗菌的屬性，阿米香樹自然也不例外，因此可預防傳染性疾病，只是它的抗菌強度如何則尚未能確定。既然像檀香，阿米香樹應也有益於泌尿方面的問題，不過另一個類似檀香的功用―催情，則有待個人的觀察體驗了。",
      skinEffect: "倍半萜類多具消炎的特質，所以富含倍半萜的阿米香樹大概也能安撫發炎的狀況。另一方面，它具有像木材燃燒的氣味，這是否也意味著它能使油性皮膚質乾化呢？",
      blendingOils: "安息香、快樂鼠尾草、欖香脂、乳香、白松香、天竺葵、茉莉、薰衣草、香蜂草、玫瑰、花梨木、依蘭。",
      formulas: "待商確。",
      carrierOils: "待商確。",
      usage: "待商確。"
    }
  },
  {
    id: "oil-2",
    category: "精油",
    name: "歐白芷",
    englishName: "Angelica",
    constitutionTag: "血瘀",
    chemicalTag: "單萜烯",
    description: "它用來強化組織結構。它賦予淋巴系統活力，藉排汗的功能加速淨化作用，尤其在長期臥病之後，可幫助身體釋放毒素。。",
    oilTable: {
      typePart: "藥草／種子或根",
      method: "蒸餾法",
      latin: "當歸屬 Angelica archangelica",
      family: "繖形科 Apiaceae",
      nature: "辛、甘、苦、溫",
      meridian: "入心、肝、脾經",
      constitution: "\n1.活血、行氣、祛風\n2.促進消化，改善脹氣\n3.養肝\n4.通經，幫助子宮收縮\n5.增加血液循環\n6.用於婦女月經不調、經閉、痛經、產後瘀滯腹痛等",
      // 💡 記得在資料庫這裡補上 indications 欄位
      indications: "催產",
      noteAnalogy: "低音",
      planet: "太陽",
      origin: "匈牙利、波蘭、比利時、荷蘭、法國"
    },
    oilDetails: {
      scent: "甜甜的藥草香，略帶麝香味。",
      appearance: "這種藥草很喜歡水，常可在河邊或溪畔發現，長得頗高，寬大的葉片有的又形成較小的卷葉，其上還點綴了綠白色的小花。歐白芷品種眾多，分別生長在北歐、冰島、格陵蘭以及俄羅斯中部，至於其精油多半產自英國與比利時。",
      historyMyth: "在16世紀的某個時期，歐白芷從北非來到了歐洲氣候較溫暖的一些地區。因為它在一年中首次開花的日子是5月8日―天使長聖麥可日，這使它常出現在一些神秘儀式中，由此不難理解，為何它常被種在修道院，而且被稱作「天使草」了。\n在法國很流行的一些酒，像是查爾特勒酒與本篤會甜酒中，都用到了這種可愛的藥草。後來它又成為討喜的庭園植物，普遍認為它可以抵抗瘟疫。1665年，醫師學院出版了一本小冊子，上面載有一則皇家處方，其中便列有「歐白芷水」這味藥材，而那一年也正是倫敦大瘟疫蔓延時期。古代名醫巴拉斯索斯（Paracelsus）對它推崇備至，甚至認為它是一種萬靈丹，常用以調味琴酒，增添香水的風情，傳統上則將它製成糖食甜點。",
      chemistry: "醇類——龍腦、芫荽油醇 \n內酯——香柑油內酯 \n萜烴——檸檬烯、水茴香萜、松油萜",
      attribute: "抗痙攣、催情、袪腸胃脹氣、利尿、通經、化痰、利肝、利胃、激勵、促發汗、補身。",
      caution: "使用過量將過度刺激神經系統，可能導致失眠，也可能引起皮膚對光過敏，亦即在曝曬太陽之後，使皮膚出現刺激反應。最好不要在懷孕期間使用，有些人還建議糖尿病患者也該避免使用。",
      mindEffect: "神經系統的強心劑，迅速消除壓力和筋疲力竭之感，帶來平衡的感覺。使疲憊的心靈和搖擺不定的情緒重現生機，賦予面對難題的動力。",
      bodyEffect: "\n一、歐白芷補身的功能，對身體有很強的治癒力，特別是在剛開始治療時，將它用來強化組織結構。它賦予淋巴系統活力，藉排汗的功能加速淨化作用，尤其在長期臥病之後，可幫助身體釋放毒素。\n二、改善消化不良、脹氣，反胃不適，胃潰瘍和絞痛。可開胃，幫助神經性厭食症，相傳也是肝、脾的補品。它在泌尿方面的抗菌功能對膀胱炎頗有助益。\n三、袪痰的特性對於感冒發燒、慢性支氣管炎和胸膜炎都有益處，可紓緩神經緊張的氣喘、呼吸急促、煙槍型咳嗽，也能恢復嗅覺的功能，顯然是肺部的全方位補品。據說可以促進雌激素之生成，所以能規律經期，減輕經痛，並幫助排出胞衣。對男性和女性的不孕症，療效頗為出名。\n四、控制尿酸，有益於風濕病、關節炎以及痛風和坐骨神經痛。\n五、迅速止痛，無論是頭痛、牙痛或是偏頭痛。另外，它還能中和蛇毒。",
      skinEffect: "良好的護膚品，具有消炎功能，對各種皮膚問題都有所幫助，處理黴菌寄生問題的功效卓著。",
      blendingOils: "羅勒、洋甘菊、天竺葵、葡萄柚、薰衣草、檸檬、桔。",
      formulas: "待填寫。",
      carrierOils: "待填寫。",
      usage: "1. 局部點塗：用棉花棒沾取極少量純精油，精準點在紅腫痘痘上。 2. 蒸汽嗅吸：盆中盛熱水滴入 1 滴茶樹，用毛巾蓋頭嗅吸。"
    }
  }
];